# Указывает базовый образ, который будет использоваться для создания нового образа Docker. В данном случае используется образ Node.js на базе Alpine Linux
FROM node:16.15.1-alpine

# Создает каталог /usr/src/nuxt-app внутри образа Docker.
RUN mkdir -p /usr/src/nuxt-app
# Устанавливает рабочий каталог для последующих инструкций Dockerfile.
WORKDIR /usr/src/nuxt-app

# Обновляет список пакетов и устанавливает последние версии всех установленных пакетов в Alpine Linux.
RUN apk update && apk upgrade
# Устанавливает git
RUN apk add git

# Копирует все файлы из текущего каталога (в котором содержится проект) в каталог /usr/src/nuxt-app/ внутри образа Docker.
COPY . /usr/src/nuxt-app/
# Устанавливает все зависимости проекта, указанные в файле package.json
RUN npm install
# Запускает скрипт сборки проекта
RUN npm run build

# Сообщает Docker, что контейнер будет слушать на указанном порту во время выполнения
EXPOSE 3000

# Устанавливает переменную окружения NUXT_HOST в 0.0.0.0
ENV NUXT_HOST=0.0.0.0
# Устанавливает переменную окружения NUXT_PORT в 3000
ENV NUXT_PORT=3000      

# Запускает приложение, используя команду npm start. Это последняя команда, которая будет выполнена при запуске контейнера.
CMD [ "npm", "start" ]

# Команада для собрки контейнера 
# docker build -t maxvideo-frontend ./

# Команда запуска контейнера
# docker run -p 3000:3000 -d maxvideo-frontend
